espressif/esp-idf/components/soc/esp32/register/soc/efuse_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Type of blk0_rdata0 register */
typedef union {
    struct {
        /** rd_efuse_wr_dis : R; bitpos: [15:0]; default: 0;
         *  read for efuse_wr_disable
         */
        uint32_t rd_efuse_wr_dis:16;
        /** rd_efuse_rd_dis : R; bitpos: [19:16]; default: 0;
         *  read for efuse_rd_disable
         */
        uint32_t rd_efuse_rd_dis:4;
        /** rd_flash_crypt_cnt : R; bitpos: [26:20]; default: 0;
         *  read for flash_crypt_cnt
         */
        uint32_t rd_flash_crypt_cnt:7;
        /** rd_uart_download_dis : R; bitpos: [27]; default: 0;
         *  Disable UART download mode. Valid for ESP32 V3 and newer, only
         */
        uint32_t rd_uart_download_dis:1;
        /** reserved_0_28 : R; bitpos: [31:28]; default: 0;
         *  reserved
         */
        uint32_t reserved_0_28:4;
    };
    uint32_t val;
} efuse_blk0_rdata0_reg_t;

/** Type of blk0_rdata1 register */
typedef union {
    struct {
        /** rd_mac : R; bitpos: [31:0]; default: 0;
         *  MAC address
         */
        uint32_t rd_mac:32;
    };
    uint32_t val;
} efuse_blk0_rdata1_reg_t;

/** Type of blk0_rdata2 register */
typedef union {
    struct {
        /** rd_mac_1 : R; bitpos: [15:0]; default: 0;
         *  MAC address
         */
        uint32_t rd_mac_1:16;
        /** rd_mac_crc : R; bitpos: [23:16]; default: 0;
         *  CRC8 for MAC address
         */
        uint32_t rd_mac_crc:8;
        /** rd_reserve_0_88 : RW; bitpos: [31:24]; default: 0;
         *  Reserved, it was created by set_missed_fields_in_regs func
         */
        uint32_t rd_reserve_0_88:8;
    };
    uint32_t val;
} efuse_blk0_rdata2_reg_t;

/** Type of blk0_rdata3 register */
typedef union {
    struct {
        /** rd_disable_app_cpu : R; bitpos: [0]; default: 0;
         *  Disables APP CPU
         */
        uint32_t rd_disable_app_cpu:1;
        /** rd_disable_bt : R; bitpos: [1]; default: 0;
         *  Disables Bluetooth
         */
        uint32_t rd_disable_bt:1;
        /** rd_chip_package_4bit : R; bitpos: [2]; default: 0;
         *  Chip package identifier #4bit
         */
        uint32_t rd_chip_package_4bit:1;
        /** rd_dis_cache : R; bitpos: [3]; default: 0;
         *  Disables cache
         */
        uint32_t rd_dis_cache:1;
        /** rd_spi_pad_config_hd : R; bitpos: [8:4]; default: 0;
         *  read for SPI_pad_config_hd
         */
        uint32_t rd_spi_pad_config_hd:5;
        /** rd_chip_package : RW; bitpos: [11:9]; default: 0;
         *  Chip package identifier
         */
        uint32_t rd_chip_package:3;
        /** rd_chip_cpu_freq_low : RW; bitpos: [12]; default: 0;
         *  If set alongside EFUSE_RD_CHIP_CPU_FREQ_RATED, the ESP32's max CPU frequency is
         *  rated for 160MHz. 240MHz otherwise
         */
        uint32_t rd_chip_cpu_freq_low:1;
        /** rd_chip_cpu_freq_rated : RW; bitpos: [13]; default: 0;
         *  If set, the ESP32's maximum CPU frequency has been rated
         */
        uint32_t rd_chip_cpu_freq_rated:1;
        /** rd_blk3_part_reserve : RW; bitpos: [14]; default: 0;
         *  If set, this bit indicates that BLOCK3[143:96] is reserved for internal use
         */
        uint32_t rd_blk3_part_reserve:1;
        /** rd_chip_ver_rev1 : RW; bitpos: [15]; default: 0;
         *  bit is set to 1 for rev1 silicon
         */
        uint32_t rd_chip_ver_rev1:1;
        /** rd_reserve_0_112 : RW; bitpos: [31:16]; default: 0;
         *  Reserved, it was created by set_missed_fields_in_regs func
         */
        uint32_t rd_reserve_0_112:16;
    };
    uint32_t val;
} efuse_blk0_rdata3_reg_t;

/** Type of blk0_rdata4 register */
typedef union {
    struct {
        /** rd_clk8m_freq : R; bitpos: [7:0]; default: 0;
         *  8MHz clock freq override
         */
        uint32_t rd_clk8m_freq:8;
        /** rd_adc_vref : RW; bitpos: [12:8]; default: 0;
         *  True ADC reference voltage
         */
        uint32_t rd_adc_vref:5;
        /** rd_reserve_0_141 : RW; bitpos: [13]; default: 0;
         *  Reserved, it was created by set_missed_fields_in_regs func
         */
        uint32_t rd_reserve_0_141:1;
        /** rd_xpd_sdio_reg : R; bitpos: [14]; default: 0;
         *  read for XPD_SDIO_REG
         */
        uint32_t rd_xpd_sdio_reg:1;
        /** rd_xpd_sdio_tieh : R; bitpos: [15]; default: 0;
         *  If XPD_SDIO_FORCE & XPD_SDIO_REG
         */
        uint32_t rd_xpd_sdio_tieh:1;
        /** rd_xpd_sdio_force : R; bitpos: [16]; default: 0;
         *  Ignore MTDI pin (GPIO12) for VDD_SDIO on reset
         */
        uint32_t rd_xpd_sdio_force:1;
        /** rd_reserve_0_145 : RW; bitpos: [31:17]; default: 0;
         *  Reserved, it was created by set_missed_fields_in_regs func
         */
        uint32_t rd_reserve_0_145:15;
    };
    uint32_t val;
} efuse_blk0_rdata4_reg_t;

/** Type of blk0_rdata5 register */
typedef union {
    struct {
        /** rd_spi_pad_config_clk : R; bitpos: [4:0]; default: 0;
         *  read for SPI_pad_config_clk
         */
        uint32_t rd_spi_pad_config_clk:5;
        /** rd_spi_pad_config_q : R; bitpos: [9:5]; default: 0;
         *  read for SPI_pad_config_q
         */
        uint32_t rd_spi_pad_config_q:5;
        /** rd_spi_pad_config_d : R; bitpos: [14:10]; default: 0;
         *  read for SPI_pad_config_d
         */
        uint32_t rd_spi_pad_config_d:5;
        /** rd_spi_pad_config_cs0 : R; bitpos: [19:15]; default: 0;
         *  read for SPI_pad_config_cs0
         */
        uint32_t rd_spi_pad_config_cs0:5;
        /** rd_chip_ver_rev2 : R; bitpos: [20]; default: 0; */
        uint32_t rd_chip_ver_rev2:1;
        /** rd_reserve_0_181 : RW; bitpos: [21]; default: 0;
         *  Reserved, it was created by set_missed_fields_in_regs func
         */
        uint32_t rd_reserve_0_181:1;
        /** rd_vol_level_hp_inv : R; bitpos: [23:22]; default: 0;
         *  This field stores the voltage level for CPU to run at 240 MHz, or for flash/PSRAM
         *  to run at 80 MHz.0x0: level 7; 0x1: level 6; 0x2: level 5; 0x3: level 4. (RO)
         */
        uint32_t rd_vol_level_hp_inv:2;
        /** rd_wafer_version_minor : R; bitpos: [25:24]; default: 0; */
        uint32_t rd_wafer_version_minor:2;
        /** rd_reserve_0_186 : RW; bitpos: [27:26]; default: 0;
         *  Reserved, it was created by set_missed_fields_in_regs func
         */
        uint32_t rd_reserve_0_186:2;
        /** rd_flash_crypt_config : R; bitpos: [31:28]; default: 0;
         *  read for flash_crypt_config
         */
        uint32_t rd_flash_crypt_config:4;
    };
    uint32_t val;
} efuse_blk0_rdata5_reg_t;

/** Type of blk0_rdata6 register */
typedef union {
    struct {
        /** rd_coding_scheme : R; bitpos: [1:0]; default: 0;
         *  read for coding_scheme
         */
        uint32_t rd_coding_scheme:2;
        /** rd_console_debug_disable : R; bitpos: [2]; default: 0;
         *  read for console_debug_disable
         */
        uint32_t rd_console_debug_disable:1;
        /** rd_disable_sdio_host : R; bitpos: [3]; default: 0; */
        uint32_t rd_disable_sdio_host:1;
        /** rd_abs_done_0 : R; bitpos: [4]; default: 0;
         *  read for abstract_done_0
         */
        uint32_t rd_abs_done_0:1;
        /** rd_abs_done_1 : R; bitpos: [5]; default: 0;
         *  read for abstract_done_1
         */
        uint32_t rd_abs_done_1:1;
        /** rd_jtag_disable : R; bitpos: [6]; default: 0;
         *  Disable JTAG
         */
        uint32_t rd_jtag_disable:1;
        /** rd_disable_dl_encrypt : R; bitpos: [7]; default: 0;
         *  read for download_dis_encrypt
         */
        uint32_t rd_disable_dl_encrypt:1;
        /** rd_disable_dl_decrypt : R; bitpos: [8]; default: 0;
         *  read for download_dis_decrypt
         */
        uint32_t rd_disable_dl_decrypt:1;
        /** rd_disable_dl_cache : R; bitpos: [9]; default: 0;
         *  read for download_dis_cache
         */
        uint32_t rd_disable_dl_cache:1;
        /** rd_key_status : R; bitpos: [10]; default: 0;
         *  read for key_status
         */
        uint32_t rd_key_status:1;
        /** rd_reserve_0_203 : RW; bitpos: [31:11]; default: 0;
         *  Reserved, it was created by set_missed_fields_in_regs func
         */
        uint32_t rd_reserve_0_203:21;
    };
    uint32_t val;
} efuse_blk0_rdata6_reg_t;

/** Type of blk0_wdata0 register */
typedef union {
    struct {
        /** wr_dis : RW; bitpos: [15:0]; default: 0;
         *  program for efuse_wr_disable
         */
        uint32_t wr_dis:16;
        /** rd_dis : RW; bitpos: [19:16]; default: 0;
         *  program for efuse_rd_disable
         */
        uint32_t rd_dis:4;
        /** flash_crypt_cnt : RW; bitpos: [26:20]; default: 0;
         *  program for flash_crypt_cnt
         */
        uint32_t flash_crypt_cnt:7;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} efuse_blk0_wdata0_reg_t;

