espressif/esp-idf/components/soc/esp32/register/soc/efuse_struct.h
/** Type of blk0_wdata1 register */
typedef union {
    struct {
        /** wifi_mac_crc_low : RW; bitpos: [31:0]; default: 0;
         *  program for low 32bit WIFI_MAC_Address
         */
        uint32_t wifi_mac_crc_low:32;
    };
    uint32_t val;
} efuse_blk0_wdata1_reg_t;

/** Type of blk0_wdata2 register */
typedef union {
    struct {
        /** wifi_mac_crc_high : RW; bitpos: [23:0]; default: 0;
         *  program for high 24bit WIFI_MAC_Address
         */
        uint32_t wifi_mac_crc_high:24;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} efuse_blk0_wdata2_reg_t;

/** Type of blk0_wdata3 register */
typedef union {
    struct {
        /** disable_app_cpu : R; bitpos: [0]; default: 0;
         *  Disables APP CPU
         */
        uint32_t disable_app_cpu:1;
        /** disable_bt : R; bitpos: [1]; default: 0;
         *  Disables Bluetooth
         */
        uint32_t disable_bt:1;
        /** chip_package_4bit : R; bitpos: [2]; default: 0;
         *  Chip package identifier #4bit
         */
        uint32_t chip_package_4bit:1;
        /** dis_cache : R; bitpos: [3]; default: 0;
         *  Disables cache
         */
        uint32_t dis_cache:1;
        /** spi_pad_config_hd : R; bitpos: [8:4]; default: 0;
         *  program for SPI_pad_config_hd
         */
        uint32_t spi_pad_config_hd:5;
        /** chip_package : RW; bitpos: [11:9]; default: 0;
         *  Chip package identifier
         */
        uint32_t chip_package:3;
        /** chip_cpu_freq_low : RW; bitpos: [12]; default: 0;
         *  If set alongside EFUSE_RD_CHIP_CPU_FREQ_RATED, the ESP32's max CPU frequency is
         *  rated for 160MHz. 240MHz otherwise
         */
        uint32_t chip_cpu_freq_low:1;
        /** chip_cpu_freq_rated : RW; bitpos: [13]; default: 0;
         *  If set, the ESP32's maximum CPU frequency has been rated
         */
        uint32_t chip_cpu_freq_rated:1;
        /** blk3_part_reserve : RW; bitpos: [14]; default: 0;
         *  If set, this bit indicates that BLOCK3[143:96] is reserved for internal use
         */
        uint32_t blk3_part_reserve:1;
        /** chip_ver_rev1 : RW; bitpos: [15]; default: 0;
         *  bit is set to 1 for rev1 silicon
         */
        uint32_t chip_ver_rev1:1;
        /** reserve_0_112 : RW; bitpos: [31:16]; default: 0;
         *  Reserved, it was created by set_missed_fields_in_regs func
         */
        uint32_t reserve_0_112:16;
    };
    uint32_t val;
} efuse_blk0_wdata3_reg_t;

/** Type of blk0_wdata4 register */
typedef union {
    struct {
        /** clk8m_freq : R; bitpos: [7:0]; default: 0;
         *  8MHz clock freq override
         */
        uint32_t clk8m_freq:8;
        /** adc_vref : RW; bitpos: [12:8]; default: 0;
         *  True ADC reference voltage
         */
        uint32_t adc_vref:5;
        /** reserve_0_141 : RW; bitpos: [13]; default: 0;
         *  Reserved, it was created by set_missed_fields_in_regs func
         */
        uint32_t reserve_0_141:1;
        /** xpd_sdio_reg : R; bitpos: [14]; default: 0;
         *  program for XPD_SDIO_REG
         */
        uint32_t xpd_sdio_reg:1;
        /** xpd_sdio_tieh : R; bitpos: [15]; default: 0;
         *  If XPD_SDIO_FORCE & XPD_SDIO_REG
         */
        uint32_t xpd_sdio_tieh:1;
        /** xpd_sdio_force : R; bitpos: [16]; default: 0;
         *  Ignore MTDI pin (GPIO12) for VDD_SDIO on reset
         */
        uint32_t xpd_sdio_force:1;
        /** reserve_0_145 : RW; bitpos: [31:17]; default: 0;
         *  Reserved, it was created by set_missed_fields_in_regs func
         */
        uint32_t reserve_0_145:15;
    };
    uint32_t val;
} efuse_blk0_wdata4_reg_t;

/** Type of blk0_wdata5 register */
typedef union {
    struct {
        /** spi_pad_config_clk : R; bitpos: [4:0]; default: 0;
         *  program for SPI_pad_config_clk
         */
        uint32_t spi_pad_config_clk:5;
        /** spi_pad_config_q : R; bitpos: [9:5]; default: 0;
         *  program for SPI_pad_config_q
         */
        uint32_t spi_pad_config_q:5;
        /** spi_pad_config_d : R; bitpos: [14:10]; default: 0;
         *  program for SPI_pad_config_d
         */
        uint32_t spi_pad_config_d:5;
        /** spi_pad_config_cs0 : R; bitpos: [19:15]; default: 0;
         *  program for SPI_pad_config_cs0
         */
        uint32_t spi_pad_config_cs0:5;
        /** chip_ver_rev2 : R; bitpos: [20]; default: 0; */
        uint32_t chip_ver_rev2:1;
        /** reserve_0_181 : RW; bitpos: [21]; default: 0;
         *  Reserved, it was created by set_missed_fields_in_regs func
         */
        uint32_t reserve_0_181:1;
        /** vol_level_hp_inv : R; bitpos: [23:22]; default: 0;
         *  This field stores the voltage level for CPU to run at 240 MHz, or for flash/PSRAM
         *  to run at 80 MHz.0x0: level 7; 0x1: level 6; 0x2: level 5; 0x3: level 4. (RO)
         */
        uint32_t vol_level_hp_inv:2;
        /** wafer_version_minor : R; bitpos: [25:24]; default: 0; */
        uint32_t wafer_version_minor:2;
        /** reserve_0_186 : RW; bitpos: [27:26]; default: 0;
         *  Reserved, it was created by set_missed_fields_in_regs func
         */
        uint32_t reserve_0_186:2;
        /** flash_crypt_config : R; bitpos: [31:28]; default: 0;
         *  program for flash_crypt_config
         */
        uint32_t flash_crypt_config:4;
    };
    uint32_t val;
} efuse_blk0_wdata5_reg_t;

/** Type of blk0_wdata6 register */
typedef union {
    struct {
        /** coding_scheme : RW; bitpos: [1:0]; default: 0;
         *  program for coding_scheme
         */
        uint32_t coding_scheme:2;
        /** console_debug_disable : RW; bitpos: [2]; default: 0;
         *  program for console_debug_disable
         */
        uint32_t console_debug_disable:1;
        /** disable_sdio_host : RW; bitpos: [3]; default: 0; */
        uint32_t disable_sdio_host:1;
        /** abs_done_0 : RW; bitpos: [4]; default: 0;
         *  program for abstract_done_0
         */
        uint32_t abs_done_0:1;
        /** abs_done_1 : RW; bitpos: [5]; default: 0;
         *  program for abstract_done_1
         */
        uint32_t abs_done_1:1;
        /** disable_jtag : RW; bitpos: [6]; default: 0;
         *  program for JTAG_disable
         */
        uint32_t disable_jtag:1;
        /** disable_dl_encrypt : RW; bitpos: [7]; default: 0;
         *  program for download_dis_encrypt
         */
        uint32_t disable_dl_encrypt:1;
        /** disable_dl_decrypt : RW; bitpos: [8]; default: 0;
         *  program for download_dis_decrypt
         */
        uint32_t disable_dl_decrypt:1;
        /** disable_dl_cache : RW; bitpos: [9]; default: 0;
         *  program for download_dis_cache
         */
        uint32_t disable_dl_cache:1;
        /** key_status : RW; bitpos: [10]; default: 0;
         *  program for key_status
         */
        uint32_t key_status:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} efuse_blk0_wdata6_reg_t;

