espressif/esp-idf/components/soc/esp32/register/soc/efuse_struct.h
/** Type of blk1_rdata0 register */
typedef union {
    struct {
        /** rd_block1 : R; bitpos: [31:0]; default: 0;
         *  Flash encryption key
         */
        uint32_t rd_block1:32;
    };
    uint32_t val;
} efuse_blk1_rdata0_reg_t;

/** Type of blk1_rdata1 register */
typedef union {
    struct {
        /** rd_block1_1 : R; bitpos: [31:0]; default: 0;
         *  Flash encryption key
         */
        uint32_t rd_block1_1:32;
    };
    uint32_t val;
} efuse_blk1_rdata1_reg_t;

/** Type of blk1_rdata2 register */
typedef union {
    struct {
        /** rd_block1_2 : R; bitpos: [31:0]; default: 0;
         *  Flash encryption key
         */
        uint32_t rd_block1_2:32;
    };
    uint32_t val;
} efuse_blk1_rdata2_reg_t;

/** Type of blk1_rdata3 register */
typedef union {
    struct {
        /** rd_block1_3 : R; bitpos: [31:0]; default: 0;
         *  Flash encryption key
         */
        uint32_t rd_block1_3:32;
    };
    uint32_t val;
} efuse_blk1_rdata3_reg_t;

/** Type of blk1_rdata4 register */
typedef union {
    struct {
        /** rd_block1_4 : R; bitpos: [31:0]; default: 0;
         *  Flash encryption key
         */
        uint32_t rd_block1_4:32;
    };
    uint32_t val;
} efuse_blk1_rdata4_reg_t;

/** Type of blk1_rdata5 register */
typedef union {
    struct {
        /** rd_block1_5 : R; bitpos: [31:0]; default: 0;
         *  Flash encryption key
         */
        uint32_t rd_block1_5:32;
    };
    uint32_t val;
} efuse_blk1_rdata5_reg_t;

/** Type of blk1_rdata6 register */
typedef union {
    struct {
        /** rd_block1_6 : R; bitpos: [31:0]; default: 0;
         *  Flash encryption key
         */
        uint32_t rd_block1_6:32;
    };
    uint32_t val;
} efuse_blk1_rdata6_reg_t;

/** Type of blk1_rdata7 register */
typedef union {
    struct {
        /** rd_block1_7 : R; bitpos: [31:0]; default: 0;
         *  Flash encryption key
         */
        uint32_t rd_block1_7:32;
    };
    uint32_t val;
} efuse_blk1_rdata7_reg_t;

/** Type of blk2_rdata0 register */
typedef union {
    struct {
        /** rd_block2 : R; bitpos: [31:0]; default: 0;
         *  Security boot key
         */
        uint32_t rd_block2:32;
    };
    uint32_t val;
} efuse_blk2_rdata0_reg_t;

/** Type of blk2_rdata1 register */
typedef union {
    struct {
        /** rd_block2_1 : R; bitpos: [31:0]; default: 0;
         *  Security boot key
         */
        uint32_t rd_block2_1:32;
    };
    uint32_t val;
} efuse_blk2_rdata1_reg_t;

/** Type of blk2_rdata2 register */
typedef union {
    struct {
        /** rd_block2_2 : R; bitpos: [31:0]; default: 0;
         *  Security boot key
         */
        uint32_t rd_block2_2:32;
    };
    uint32_t val;
} efuse_blk2_rdata2_reg_t;

/** Type of blk2_rdata3 register */
typedef union {
    struct {
        /** rd_block2_3 : R; bitpos: [31:0]; default: 0;
         *  Security boot key
         */
        uint32_t rd_block2_3:32;
    };
    uint32_t val;
} efuse_blk2_rdata3_reg_t;

/** Type of blk2_rdata4 register */
typedef union {
    struct {
        /** rd_block2_4 : R; bitpos: [31:0]; default: 0;
         *  Security boot key
         */
        uint32_t rd_block2_4:32;
    };
    uint32_t val;
} efuse_blk2_rdata4_reg_t;

/** Type of blk2_rdata5 register */
typedef union {
    struct {
        /** rd_block2_5 : R; bitpos: [31:0]; default: 0;
         *  Security boot key
         */
        uint32_t rd_block2_5:32;
    };
    uint32_t val;
} efuse_blk2_rdata5_reg_t;

/** Type of blk2_rdata6 register */
typedef union {
    struct {
        /** rd_block2_6 : R; bitpos: [31:0]; default: 0;
         *  Security boot key
         */
        uint32_t rd_block2_6:32;
    };
    uint32_t val;
} efuse_blk2_rdata6_reg_t;

/** Type of blk2_rdata7 register */
typedef union {
    struct {
        /** rd_block2_7 : R; bitpos: [31:0]; default: 0;
         *  Security boot key
         */
        uint32_t rd_block2_7:32;
    };
    uint32_t val;
} efuse_blk2_rdata7_reg_t;

/** Type of blk3_rdata0 register */
typedef union {
    struct {
        /** rd_custom_mac_crc : R; bitpos: [7:0]; default: 0;
         *  CRC8 for custom MAC address
         */
        uint32_t rd_custom_mac_crc:8;
        /** rd_custom_mac : R; bitpos: [31:8]; default: 0;
         *  Custom MAC address
         */
        uint32_t rd_custom_mac:24;
    };
    uint32_t val;
} efuse_blk3_rdata0_reg_t;

/** Type of blk3_rdata1 register */
typedef union {
    struct {
        /** rd_custom_mac_1 : R; bitpos: [23:0]; default: 0;
         *  Custom MAC address
         */
        uint32_t rd_custom_mac_1:24;
        /** reserved_3_56 : R; bitpos: [31:24]; default: 0;
         *  reserved
         */
        uint32_t reserved_3_56:8;
    };
    uint32_t val;
} efuse_blk3_rdata1_reg_t;

/** Type of blk3_rdata2 register */
typedef union {
    struct {
        /** rd_blk3_reserved_2 : R; bitpos: [31:0]; default: 0;
         *  read for BLOCK3
         */
        uint32_t rd_blk3_reserved_2:32;
    };
    uint32_t val;
} efuse_blk3_rdata2_reg_t;

/** Type of blk3_rdata3 register */
typedef union {
    struct {
        /** rd_adc1_tp_low : RW; bitpos: [6:0]; default: 0;
         *  ADC1 Two Point calibration low point. Only valid if EFUSE_RD_BLK3_PART_RESERVE
         */
        uint32_t rd_adc1_tp_low:7;
        /** rd_adc1_tp_high : RW; bitpos: [15:7]; default: 0;
         *  ADC1 Two Point calibration high point. Only valid if EFUSE_RD_BLK3_PART_RESERVE
         */
        uint32_t rd_adc1_tp_high:9;
        /** rd_adc2_tp_low : RW; bitpos: [22:16]; default: 0;
         *  ADC2 Two Point calibration low point. Only valid if EFUSE_RD_BLK3_PART_RESERVE
         */
        uint32_t rd_adc2_tp_low:7;
        /** rd_adc2_tp_high : RW; bitpos: [31:23]; default: 0;
         *  ADC2 Two Point calibration high point. Only valid if EFUSE_RD_BLK3_PART_RESERVE
         */
        uint32_t rd_adc2_tp_high:9;
    };
    uint32_t val;
} efuse_blk3_rdata3_reg_t;

/** Type of blk3_rdata4 register */
typedef union {
    struct {
        /** rd_secure_version : R; bitpos: [31:0]; default: 0;
         *  Secure version for anti-rollback
         */
        uint32_t rd_secure_version:32;
    };
    uint32_t val;
} efuse_blk3_rdata4_reg_t;

/** Type of blk3_rdata5 register */
typedef union {
    struct {
        /** reserved_3_160 : R; bitpos: [23:0]; default: 0;
         *  reserved
         */
        uint32_t reserved_3_160:24;
        /** rd_mac_version : R; bitpos: [31:24]; default: 0;
         *  Custom MAC version
         */
        uint32_t rd_mac_version:8;
    };
    uint32_t val;
} efuse_blk3_rdata5_reg_t;

/** Type of blk3_rdata6 register */
typedef union {
    struct {
        /** rd_blk3_reserved_6 : R; bitpos: [31:0]; default: 0;
         *  read for BLOCK3
         */
        uint32_t rd_blk3_reserved_6:32;
    };
    uint32_t val;
} efuse_blk3_rdata6_reg_t;

