espressif/esp-idf/components/soc/esp32/register/soc/efuse_struct.h
/** Type of blk3_rdata7 register */
typedef union {
    struct {
        /** rd_blk3_reserved_7 : R; bitpos: [31:0]; default: 0;
         *  read for BLOCK3
         */
        uint32_t rd_blk3_reserved_7:32;
    };
    uint32_t val;
} efuse_blk3_rdata7_reg_t;

/** Type of blk1_wdata0 register */
typedef union {
    struct {
        /** blk1_din0 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK1
         */
        uint32_t blk1_din0:32;
    };
    uint32_t val;
} efuse_blk1_wdata0_reg_t;

/** Type of blk1_wdata1 register */
typedef union {
    struct {
        /** blk1_din1 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK1
         */
        uint32_t blk1_din1:32;
    };
    uint32_t val;
} efuse_blk1_wdata1_reg_t;

/** Type of blk1_wdata2 register */
typedef union {
    struct {
        /** blk1_din2 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK1
         */
        uint32_t blk1_din2:32;
    };
    uint32_t val;
} efuse_blk1_wdata2_reg_t;

/** Type of blk1_wdata3 register */
typedef union {
    struct {
        /** blk1_din3 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK1
         */
        uint32_t blk1_din3:32;
    };
    uint32_t val;
} efuse_blk1_wdata3_reg_t;

/** Type of blk1_wdata4 register */
typedef union {
    struct {
        /** blk1_din4 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK1
         */
        uint32_t blk1_din4:32;
    };
    uint32_t val;
} efuse_blk1_wdata4_reg_t;

/** Type of blk1_wdata5 register */
typedef union {
    struct {
        /** blk1_din5 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK1
         */
        uint32_t blk1_din5:32;
    };
    uint32_t val;
} efuse_blk1_wdata5_reg_t;

/** Type of blk1_wdata6 register */
typedef union {
    struct {
        /** blk1_din6 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK1
         */
        uint32_t blk1_din6:32;
    };
    uint32_t val;
} efuse_blk1_wdata6_reg_t;

/** Type of blk1_wdata7 register */
typedef union {
    struct {
        /** blk1_din7 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK1
         */
        uint32_t blk1_din7:32;
    };
    uint32_t val;
} efuse_blk1_wdata7_reg_t;

/** Type of blk2_wdata0 register */
typedef union {
    struct {
        /** blk2_din0 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK2
         */
        uint32_t blk2_din0:32;
    };
    uint32_t val;
} efuse_blk2_wdata0_reg_t;

/** Type of blk2_wdata1 register */
typedef union {
    struct {
        /** blk2_din1 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK2
         */
        uint32_t blk2_din1:32;
    };
    uint32_t val;
} efuse_blk2_wdata1_reg_t;

/** Type of blk2_wdata2 register */
typedef union {
    struct {
        /** blk2_din2 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK2
         */
        uint32_t blk2_din2:32;
    };
    uint32_t val;
} efuse_blk2_wdata2_reg_t;

/** Type of blk2_wdata3 register */
typedef union {
    struct {
        /** blk2_din3 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK2
         */
        uint32_t blk2_din3:32;
    };
    uint32_t val;
} efuse_blk2_wdata3_reg_t;

/** Type of blk2_wdata4 register */
typedef union {
    struct {
        /** blk2_din4 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK2
         */
        uint32_t blk2_din4:32;
    };
    uint32_t val;
} efuse_blk2_wdata4_reg_t;

/** Type of blk2_wdata5 register */
typedef union {
    struct {
        /** blk2_din5 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK2
         */
        uint32_t blk2_din5:32;
    };
    uint32_t val;
} efuse_blk2_wdata5_reg_t;

/** Type of blk2_wdata6 register */
typedef union {
    struct {
        /** blk2_din6 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK2
         */
        uint32_t blk2_din6:32;
    };
    uint32_t val;
} efuse_blk2_wdata6_reg_t;

/** Type of blk2_wdata7 register */
typedef union {
    struct {
        /** blk2_din7 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK2
         */
        uint32_t blk2_din7:32;
    };
    uint32_t val;
} efuse_blk2_wdata7_reg_t;

/** Type of blk3_wdata0 register */
typedef union {
    struct {
        /** blk3_din0 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK3
         */
        uint32_t blk3_din0:32;
    };
    uint32_t val;
} efuse_blk3_wdata0_reg_t;

/** Type of blk3_wdata1 register */
typedef union {
    struct {
        /** blk3_din1 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK3
         */
        uint32_t blk3_din1:32;
    };
    uint32_t val;
} efuse_blk3_wdata1_reg_t;

/** Type of blk3_wdata2 register */
typedef union {
    struct {
        /** blk3_din2 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK3
         */
        uint32_t blk3_din2:32;
    };
    uint32_t val;
} efuse_blk3_wdata2_reg_t;

/** Type of blk3_wdata3 register */
typedef union {
    struct {
        /** adc1_tp_low : RW; bitpos: [6:0]; default: 0;
         *  ADC1 Two Point calibration low point. Only valid if EFUSE_RD_BLK3_PART_RESERVE
         */
        uint32_t adc1_tp_low:7;
        /** adc1_tp_high : RW; bitpos: [15:7]; default: 0;
         *  ADC1 Two Point calibration high point. Only valid if EFUSE_RD_BLK3_PART_RESERVE
         */
        uint32_t adc1_tp_high:9;
        /** adc2_tp_low : RW; bitpos: [22:16]; default: 0;
         *  ADC2 Two Point calibration low point. Only valid if EFUSE_RD_BLK3_PART_RESERVE
         */
        uint32_t adc2_tp_low:7;
        /** adc2_tp_high : RW; bitpos: [31:23]; default: 0;
         *  ADC2 Two Point calibration high point. Only valid if EFUSE_RD_BLK3_PART_RESERVE
         */
        uint32_t adc2_tp_high:9;
    };
    uint32_t val;
} efuse_blk3_wdata3_reg_t;

/** Type of blk3_wdata4 register */
typedef union {
    struct {
        /** secure_version : R; bitpos: [31:0]; default: 0;
         *  Secure version for anti-rollback
         */
        uint32_t secure_version:32;
    };
    uint32_t val;
} efuse_blk3_wdata4_reg_t;

