espressif/esp-idf/components/soc/esp32/register/soc/efuse_struct.h
/** Type of blk3_wdata5 register */
typedef union {
    struct {
        /** blk3_din5 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK3
         */
        uint32_t blk3_din5:32;
    };
    uint32_t val;
} efuse_blk3_wdata5_reg_t;

/** Type of blk3_wdata6 register */
typedef union {
    struct {
        /** blk3_din6 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK3
         */
        uint32_t blk3_din6:32;
    };
    uint32_t val;
} efuse_blk3_wdata6_reg_t;

/** Type of blk3_wdata7 register */
typedef union {
    struct {
        /** blk3_din7 : RW; bitpos: [31:0]; default: 0;
         *  program for BLOCK3
         */
        uint32_t blk3_din7:32;
    };
    uint32_t val;
} efuse_blk3_wdata7_reg_t;

/** Type of clk register */
typedef union {
    struct {
        /** clk_sel0 : RW; bitpos: [7:0]; default: 82;
         *  efuse timing configure
         */
        uint32_t clk_sel0:8;
        /** clk_sel1 : RW; bitpos: [15:8]; default: 64;
         *  efuse timing configure
         */
        uint32_t clk_sel1:8;
        /** clk_en : RW; bitpos: [16]; default: 0; */
        uint32_t clk_en:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} efuse_clk_reg_t;

/** Type of conf register */
typedef union {
    struct {
        /** op_code : RW; bitpos: [15:0]; default: 0;
         *  efuse operation code
         */
        uint32_t op_code:16;
        /** force_no_wr_rd_dis : RW; bitpos: [16]; default: 1; */
        uint32_t force_no_wr_rd_dis:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} efuse_conf_reg_t;

/** Type of status register */
typedef union {
    struct {
        /** debug : R; bitpos: [31:0]; default: 0; */
        uint32_t debug:32;
    };
    uint32_t val;
} efuse_status_reg_t;

/** Type of cmd register */
typedef union {
    struct {
        /** read_cmd : RW; bitpos: [0]; default: 0;
         *  command for read
         */
        uint32_t read_cmd:1;
        /** pgm_cmd : RW; bitpos: [1]; default: 0;
         *  command for program
         */
        uint32_t pgm_cmd:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} efuse_cmd_reg_t;

/** Type of int_raw register */
typedef union {
    struct {
        /** read_done_int_raw : R; bitpos: [0]; default: 0;
         *  read done interrupt raw status
         */
        uint32_t read_done_int_raw:1;
        /** pgm_done_int_raw : R; bitpos: [1]; default: 0;
         *  program done interrupt raw status
         */
        uint32_t pgm_done_int_raw:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} efuse_int_raw_reg_t;

/** Type of int_st register */
typedef union {
    struct {
        /** read_done_int_st : R; bitpos: [0]; default: 0;
         *  read done interrupt status
         */
        uint32_t read_done_int_st:1;
        /** pgm_done_int_st : R; bitpos: [1]; default: 0;
         *  program done interrupt status
         */
        uint32_t pgm_done_int_st:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} efuse_int_st_reg_t;

/** Type of int_ena register */
typedef union {
    struct {
        /** read_done_int_ena : RW; bitpos: [0]; default: 0;
         *  read done interrupt enable
         */
        uint32_t read_done_int_ena:1;
        /** pgm_done_int_ena : RW; bitpos: [1]; default: 0;
         *  program done interrupt enable
         */
        uint32_t pgm_done_int_ena:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} efuse_int_ena_reg_t;

/** Type of int_clr register */
typedef union {
    struct {
        /** read_done_int_clr : W; bitpos: [0]; default: 0;
         *  read done interrupt clear
         */
        uint32_t read_done_int_clr:1;
        /** pgm_done_int_clr : W; bitpos: [1]; default: 0;
         *  program done interrupt clear
         */
        uint32_t pgm_done_int_clr:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} efuse_int_clr_reg_t;

/** Type of dac_conf register */
typedef union {
    struct {
        /** dac_clk_div : RW; bitpos: [7:0]; default: 40;
         *  efuse timing configure
         */
        uint32_t dac_clk_div:8;
        /** dac_clk_pad_sel : RW; bitpos: [8]; default: 0; */
        uint32_t dac_clk_pad_sel:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} efuse_dac_conf_reg_t;

/** Type of dec_status register */
typedef union {
    struct {
        /** dec_warnings : R; bitpos: [11:0]; default: 0;
         *  the decode result of 3/4 coding scheme has warning
         */
        uint32_t dec_warnings:12;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} efuse_dec_status_reg_t;

/** Type of date register */
typedef union {
    struct {
        /** date : RW; bitpos: [31:0]; default: 369370624; */
        uint32_t date:32;
    };
    uint32_t val;
} efuse_date_reg_t;


typedef struct {
    volatile efuse_blk0_rdata0_reg_t blk0_rdata0;
    volatile efuse_blk0_rdata1_reg_t blk0_rdata1;
    volatile efuse_blk0_rdata2_reg_t blk0_rdata2;
    volatile efuse_blk0_rdata3_reg_t blk0_rdata3;
    volatile efuse_blk0_rdata4_reg_t blk0_rdata4;
    volatile efuse_blk0_rdata5_reg_t blk0_rdata5;
    volatile efuse_blk0_rdata6_reg_t blk0_rdata6;
    volatile efuse_blk0_wdata0_reg_t blk0_wdata0;
    volatile efuse_blk0_wdata1_reg_t blk0_wdata1;
    volatile efuse_blk0_wdata2_reg_t blk0_wdata2;
    volatile efuse_blk0_wdata3_reg_t blk0_wdata3;
    volatile efuse_blk0_wdata4_reg_t blk0_wdata4;
    volatile efuse_blk0_wdata5_reg_t blk0_wdata5;
    volatile efuse_blk0_wdata6_reg_t blk0_wdata6;
    volatile efuse_blk1_rdata0_reg_t blk1_rdata0;
    volatile efuse_blk1_rdata1_reg_t blk1_rdata1;
    volatile efuse_blk1_rdata2_reg_t blk1_rdata2;
    volatile efuse_blk1_rdata3_reg_t blk1_rdata3;
    volatile efuse_blk1_rdata4_reg_t blk1_rdata4;
    volatile efuse_blk1_rdata5_reg_t blk1_rdata5;
    volatile efuse_blk1_rdata6_reg_t blk1_rdata6;
    volatile efuse_blk1_rdata7_reg_t blk1_rdata7;
    volatile efuse_blk2_rdata0_reg_t blk2_rdata0;
    volatile efuse_blk2_rdata1_reg_t blk2_rdata1;
    volatile efuse_blk2_rdata2_reg_t blk2_rdata2;
    volatile efuse_blk2_rdata3_reg_t blk2_rdata3;
    volatile efuse_blk2_rdata4_reg_t blk2_rdata4;
    volatile efuse_blk2_rdata5_reg_t blk2_rdata5;
    volatile efuse_blk2_rdata6_reg_t blk2_rdata6;
    volatile efuse_blk2_rdata7_reg_t blk2_rdata7;
    volatile efuse_blk3_rdata0_reg_t blk3_rdata0;
    volatile efuse_blk3_rdata1_reg_t blk3_rdata1;
    volatile efuse_blk3_rdata2_reg_t blk3_rdata2;
    volatile efuse_blk3_rdata3_reg_t blk3_rdata3;
    volatile efuse_blk3_rdata4_reg_t blk3_rdata4;
    volatile efuse_blk3_rdata5_reg_t blk3_rdata5;
    volatile efuse_blk3_rdata6_reg_t blk3_rdata6;
    volatile efuse_blk3_rdata7_reg_t blk3_rdata7;
    volatile efuse_blk1_wdata0_reg_t blk1_wdata0;
    volatile efuse_blk1_wdata1_reg_t blk1_wdata1;
    volatile efuse_blk1_wdata2_reg_t blk1_wdata2;
    volatile efuse_blk1_wdata3_reg_t blk1_wdata3;
    volatile efuse_blk1_wdata4_reg_t blk1_wdata4;
    volatile efuse_blk1_wdata5_reg_t blk1_wdata5;
    volatile efuse_blk1_wdata6_reg_t blk1_wdata6;
    volatile efuse_blk1_wdata7_reg_t blk1_wdata7;
    volatile efuse_blk2_wdata0_reg_t blk2_wdata0;
    volatile efuse_blk2_wdata1_reg_t blk2_wdata1;
    volatile efuse_blk2_wdata2_reg_t blk2_wdata2;
    volatile efuse_blk2_wdata3_reg_t blk2_wdata3;
    volatile efuse_blk2_wdata4_reg_t blk2_wdata4;
    volatile efuse_blk2_wdata5_reg_t blk2_wdata5;
    volatile efuse_blk2_wdata6_reg_t blk2_wdata6;
    volatile efuse_blk2_wdata7_reg_t blk2_wdata7;
    volatile efuse_blk3_wdata0_reg_t blk3_wdata0;
    volatile efuse_blk3_wdata1_reg_t blk3_wdata1;
    volatile efuse_blk3_wdata2_reg_t blk3_wdata2;
    volatile efuse_blk3_wdata3_reg_t blk3_wdata3;
    volatile efuse_blk3_wdata4_reg_t blk3_wdata4;
    volatile efuse_blk3_wdata5_reg_t blk3_wdata5;
    volatile efuse_blk3_wdata6_reg_t blk3_wdata6;
    volatile efuse_blk3_wdata7_reg_t blk3_wdata7;
    volatile efuse_clk_reg_t clk;
    volatile efuse_conf_reg_t conf;
    volatile efuse_status_reg_t status;
    volatile efuse_cmd_reg_t cmd;
    volatile efuse_int_raw_reg_t int_raw;
    volatile efuse_int_st_reg_t int_st;
    volatile efuse_int_ena_reg_t int_ena;
    volatile efuse_int_clr_reg_t int_clr;
    volatile efuse_dac_conf_reg_t dac_conf;
    volatile efuse_dec_status_reg_t dec_status;
    uint32_t reserved_120[55];
    volatile efuse_date_reg_t date;
} efuse_dev_t;

extern efuse_dev_t EFUSE;

#ifndef __cplusplus
_Static_assert(sizeof(efuse_dev_t) == 0x200, "Invalid size of efuse_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
